In [1]:
# 이름, 국어, 영어, 수학 점수를 입력 받아 데이터 프레임에 저장 한 후 
# 이름을 인덱스로 
# 데이터프레임에 각 점수의 '총합' 컬럼 추가 결과 확인

In [7]:
import pandas as pd

df = pd.DataFrame(columns = ['이름', '국어','영어','수학'])
df

Empty DataFrame
Columns: [이름, 국어, 영어, 수학]
Index: []

In [ ]:
while True:
    name = input('이름 입력 -> ')
    if name == 'q':
        break
    data= []
    data.append( name)
    scores = input('국어 영어 수학 점수 입력 -> ').split()
    if len(scores) != 3:
        print('3 과목 입력 : ')
        continue
    for idx, score in enumerate(scores):
        data.append(int(score))
    df.loc[len(df)] = data

이름 입력 -> 홍길동
국어 영어 수학 점수 입력 -> 80 90 90
이름 입력 -> 김나래
국어 영어 수학 점수 입력 -> 70 70 80

In [3]:
df

  이름  국어  영어  수학
0  1   1   2   3

In [4]:
df.set_index('이름', inplace=True)
df

    국어  영어  수학
이름
1    1   2   3

In [5]:
df['total'] = 0
df

    국어  영어  수학  total
이름
1    1   2   3      0

In [6]:
for index in df.index:
    total = 0
    for col in df.columns[ : -1]:
        total += df.loc[index, col] 

    df.loc[index]['total'] = total
df

    국어  영어  수학  total
이름
1    1   2   3      6